{
	"compute": [
		{
			"title": "New Amazon EC2 Spot pricing model: Simplified purchasing without bidding and fewer interruptions",
			"body": "Amazon EC2 Spot Instances offer spare compute capacity in the AWS Cloud at steep discounts. Customers—including Yelp, NASA JPL, FINRA, and Autodesk—use Spot Instances to reduce costs and get faster results. Spot Instances provide acceleration, scale, and deep cost savings to big data workloads, containerized applications such as […]"
		},
		{
			"title": "Migrating Your Amazon ECS Containers to AWS Fargate",
			"body": "AWS Fargate is a new technology that works with Amazon Elastic Container Service (ECS) to run containers without having to manage servers or clusters. What does this mean? With Fargate, you no longer need to provision or manage a single virtual machine; you can just create tasks and run them directly! Fargate uses the same API actions as ECS, so […]"
		},
		{
			"title": "Invoking AWS Lambda from Amazon MQ",
			"body": "Architect Message brokers can be used to solve a number of needs in enterprise architectures, including managing workload queues and broadcasting messages to a number of subscribers. Amazon MQ is a managed message broker service for Apache ActiveMQ that makes it easy to set up and operate […]"
		}
	],
	"security": [
		{
			"title": "How we reduce complexity and rapidly iterate on Amazon GuardDuty: twelve new detections added",
			"body": "We’re relentlessly innovating on your behalf at AWS, especially when it comes to security. Last November, we launched Amazon GuardDuty, a continuous security monitoring and threat detection service that incorporates threat intelligence, anomaly detection, and machine learning to help protect your AWS resources, including your AWS accounts. Many large customers, including General Electric, Autodesk, and […]"
		},
		{
			"title": "How to Delegate Administration of Your AWS Managed Microsoft AD Directory to Your On-Premises Active Directory Users",
			"body": "You can now enable your on-premises users administer your AWS Directory Service for Microsoft Active Directory, also known as AWS Managed Microsoft AD. Using an Active Directory (AD) trust and the new AWS delegated AD security groups, you can grant administrative permissions to your on-premises users by managing group membership in your on-premises AD directory. […]"
		},
		{
			"title": "How to Use Bucket Policies and Apply Defense-in-Depth to Help Secure Your Amazon S3 Data",
			"body": "Amazon S3 provides comprehensive security and compliance capabilities that meet even the most stringent regulatory requirements. It gives you flexibility in the way you manage data for cost optimization, access control, and compliance. However, because the service is flexible, a user could accidentally configure buckets in a manner that is not secure. For example, let’s […]"
		}
	],
	"edge": [
		{
			"title": "Resizing Images with Amazon CloudFront &amp; Lambda@Edge | AWS CDN Blog",
			"body": "Do you have lots of images that need to be modified before delivery? No problem with Amazon CloudFront and Lambda@Edge. Read more on how you can use our services to modify image dimensions, apply watermarks, or optimize formats based on browser support all on the fly. Optimizing your image delivery can lead to a better experience for your users while also reducing your bandwidth usage."
		},
		{
			"title": "Adding HTTP Security Headers Using Lambda@Edge and Amazon CloudFront",
			"body": "Adding security response headers is often achievable by modifications to your application configuration. In this blog we will focus on how to achieve the same result when you have an application that can’t be modified at the origin (e.g., a web site hosted in Amazon S3)."
		},
		{
			"title": "Dynamically Route Viewer Requests to Any Origin Using Lambda@Edge",
			"body": "Today Lambda@Edge announces a new feature that allows you to do content-based routing. Now you can programmatically define the origin based on logic in your Lambda function. This enables you to route requests to different origins based on request attributes such as headers, query strings, and cookies. Read our blog post to learn about different use cases and how you can set this up within your own architecture."
		}
	],
	"hello": "hello"
}